import networkx as nx
import pandas as pd
import matplotlib.pyplot as plt

# Створюємо орієнтований граф
G = nx.DiGraph()

# Додаємо ребра з пропускною здатністю
edges = [
    ("Термінал 1", "Склад 1", 25),
    ("Термінал 1", "Склад 2", 20),
    ("Термінал 1", "Склад 3", 15),
    ("Термінал 2", "Склад 3", 15),
    ("Термінал 2", "Склад 4", 30),
    ("Термінал 2", "Склад 2", 10),
    ("Склад 1", "Магазин 1", 15),
    ("Склад 1", "Магазин 2", 10),
    ("Склад 1", "Магазин 3", 20),
    ("Склад 2", "Магазин 4", 15),
    ("Склад 2", "Магазин 5", 10),
    ("Склад 2", "Магазин 6", 25),
    ("Склад 3", "Магазин 7", 20),
    ("Склад 3", "Магазин 8", 15),
    ("Склад 3", "Магазин 9", 10),
    ("Склад 4", "Магазин 10", 20),
    ("Склад 4", "Магазин 11", 10),
    ("Склад 4", "Магазин 12", 15),
    ("Склад 4", "Магазин 13", 5),
    ("Склад 4", "Магазин 14", 10),
]

# Додаємо всі ребра до графа
G.add_weighted_edges_from(edges)

# Позиції для малювання графа
pos = {
    "Термінал 1": (1, 2),
    "Термінал 2": (5, 2),
    "Склад 1": (2, 3),
    "Склад 2": (4, 3),
    "Склад 3": (2, 1),
    "Склад 4": (4, 1),
    "Магазин 1": (0, 4),
    "Магазин 2": (1, 4),
    "Магазин 3": (2, 4),
    "Магазин 4": (3, 4),
    "Магазин 5": (4, 4),
    "Магазин 6": (5, 4),
    "Магазин 7": (0, 0),
    "Магазин 8": (1, 0),
    "Магазин 9": (2, 0),
    "Магазин 10": (3, 0),
    "Магазин 11": (4, 0),
    "Магазин 12": (5, 0),
    "Магазин 13": (6, 0),
    "Магазин 14": (7, 0)
}

# Малюємо граф
plt.figure(figsize=(12, 8))
nx.draw(G, pos, with_labels=True, node_size=2000, node_color="skyblue", font_size=8, font_weight="bold", arrows=True)
labels = nx.get_edge_attributes(G, 'weight')
nx.draw_networkx_edge_labels(G, pos, edge_labels=labels, font_size=9)

# Відображаємо граф
plt.show()
